package Calculate;
//конечно сюда страшно смотреть
/*
Некоторые странные вещи сделал, что бы показать разновидность синтаксиса
некоторые странные вещи, сделал так как смог. На самом деле это мой первый
такой сложный "минипроектик".Когда закончил, вижу многие ошибки и как классы
надо было распределить и методы подругому бы сделал, но мне сказали, что бы
попасть в ближайшую группу надо до 28 числа сдать.
По возможности, если этот код не удостоится второго этапа, дать минимальный
фидбек на почту.
Спасибо!!!
 */
public class CalculateStart {
    public static void main(String[] args) {
        System.out.print("Hello JM!!! ");
        System.out.println("Please, enter your expression.");

        LogicClass.run();
    }
}
